package Stek;

public class СТЕК {
    public static void main(String[] args) {

 //       boolean equals (Object obj);
        //Возвращает true, если указанный объект - другой StackTraceElement экземпляр, представляющий ту же самую точку выполнения как этот экземпляр.
        //Строка	getClassName()
        //Возвращает полностью определенное имя class, содержащего точку выполнения, представленную этим микроэлементом стека.
        //Строка	getFileName()
        //Возвращает имя исходного файла, содержащего точку выполнения, представленную этим микроэлементом стека.

   // int getLineNumber();

    //Возвращает номер строки исходной строки, содержащей точку выполнения, представленную этим микроэлементом стека.
    //Строка	getMethodName()
    //Возвращает имя метода, содержащего точку выполнения, представленную этим микроэлементом стека.
    //int hashCode();

    //Возвращает значение хэш-кода для этого микроэлемента стека.
    //boolean isNativeMethod();

    //Возвращает true, если метод, содержащий точку выполнения, представленную этим микроэлементом стека, является собственным методом.
   // toString();
    // Возвращает строковое представление этого микроэлемента стека.
}
}