package РегулярныеВыражения;

//public class МетодыИндексов {Методы индексов
//    Методы индексов представляют полезные значения индекса, которые демонстрируют точное количество
//    соответствий, обнаруженных в вводимой строке.
//
//№.	Метод и описание
//1	public int
//                     start()
//    Возврат начального индекса к предыдущему совпадению.
//            2	public int
//                   start(int group)
//    Возврат начального индекса к последовательности, захваченной данной группой в течение предыдущей
//    операции установления соответствия.
//3	public int
//                        end()
//    Возврат позиции смещения следом за последним совпадающим символом.
//            4	public int
//                       end(int group)
//    Возврат позиции смещения следом за последним символом к последовательности, захваченной данной
//    группой в течение предыдущей операции установления соответствия.
//}
