package РегулярныеВыражения;

public class МетодыИсследования {
// МетодыИсследованияМетоды исследования
//    Методы исследования производят анализ вводимой строки и возврат булевого значения,
// отображающего наличие либо отсутствие шаблона.
//
//            №.	Метод и описание
//1	public boolean
//           lookingAt()
//    Предпринимает попытку поиска соответствия вводимой последовательности в начале области с шаблоном.
//2	public boolean
//            find()
//    Предпринимает попытку поиска следующей подпоследовательности в вводимой последовательности, соответствующей шаблону.
//3	public boolean
//                find(int start)
//    Сброс данного поиска соответствия и попытка поиска новой подпоследовательности в вводимой последовательности, соответствующей шаблону с указанного индекса.
//            4	public
//           boolean matches()
//    Предпринимает попытку поиска совпадений во всей области с шаблоном.
}
